//
//  ViewController.m
//  XWAlertView
//
//  Created by vivi wu on 2019/5/30.
//  Copyright © 2019 vivi wu. All rights reserved.
//

#import "ViewController.h"
#import "XWReadAlert.h"

@interface ViewController ()

@end

@implementation ViewController

- (void)viewDidLoad {
    [super viewDidLoad];
    // Do any additional setup after loading the view.
}


- (void)viewDidAppear:(BOOL)animated
{
    [super viewDidAppear:animated];
    NSString * title = @"滕王阁序";
    NSString * msg= @"滕王阁序 \
    豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。\
    时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。\
    披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。\
    遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。关山难越，谁悲失路之人？萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？\
    嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！\
    勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？\
    呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：\
    滕王高阁临江渚，佩玉鸣鸾罢歌舞。\
    画栋朝飞南浦云，珠帘暮卷西山雨。\
    闲云潭影日悠悠，物换星移几度秋。\
    阁中帝子今何在？槛外长江空自流。\
    ";
    
    NSString * msg2 = @" 申购条件：\
    在申购日前2天的再往前推20天内，持有超过日均1万元的证券市值（沪深两市分开算）。不足1万元的，不满足申购新股条件。\
    沪市每1万元市值配给一个签，一个签到对应1000股；深市每1万元配给两个签，一个签对就为500股。市值在申购日可重复使用。在申购日当日，还必须有可以用于申购新股的可用资金。登录账户，输入个股的申购代码，系统会根据自己账户的情况，自动计算好自己账户的可申购数量。如果数量显示为零的，则不能参与申购\
    资者持有的市值指T-2日前20个交易日（含T-2日）的日均持有市值(T日为申购日，下同),包括本市场非限售A股股份市值，不包括优先股、B股、基金、债券或其他证券。交易型开放式指数基金不包括在申购市值范围内。\
    投资者网上申购数量不得超过T-2日前20个交易日（含T-2日）的日均持有市值，也不得超过主承销商规定的申购上限，且必须足额缴款。";
    msg2 = @"申购条件 自行百度";
    
    NSString * title2 = @"新股申购需要注意的 ";
    
    XWReadAlert * alert = [XWReadAlert ShowAlertWith:title2 message:msg2 delay:5];
    
    alert.okBtnHander = ^(){
        NSLog(@"%s", __func__);
    };
    alert.noBtnHander = ^(){
        NSLog(@"%s", __func__);
    };
    alert.timerBtnHander = ^(){
        NSLog(@"%s", __func__);
    };
}

@end
